  /**
  *Author:余洋
  *Date:2019年4月3日 
  *Time:下午10:49:03
  *Declaration: All Rights Reserved !!!
  */
  package day02test04;
  
//  （1）声明一个圆柱体类型，
//  （2）声明属性：底边的半径，和高
//  （3）声明方法：
//  A：方法的功能：在方法中打印圆柱体的详细信息
//  	圆柱体的底边的半径是xxx，高是xxx，底面积是xxx，体积是xxx。
//  B：方法的功能：返回底面积 
//  C：方法的功能：返回体积
//  D：方法的功能：为圆柱体的底边的半径，和高赋值
//  E：方法的功能：为圆柱体的底边的半径，和高赋值，并返回赋值的结果
//  	如果底边的半径或高为<=0，赋值失败，返回false，否则返回true
//  （4）并测试	
  public class Yuanzhu {
	  
	  int bj;  //半径
	  int high; //高度
	  
	  

}
